load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      name: 'Ramping up to 1000 requests per second'
  headers: 
    User-Agent: "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/121.0.0.0 Safari/537.36"
scenarios:
  - name: 'redirect URL'
    flow:
      - get:
          url: '/url/RqKxekjp'